### Module 4 Clean Data with Pandas
- pandas(python data analysis library)
- use to clean data
- most of the time, the data set is real dirty.
- array and dataframe are different
- pandas more much powerful than numpy.
- arrays for arrays
- pandas for dataframe

In [2]:
#standard import statements
import numpy as np #for mathmatics 
import pandas as pd 
import matplotlib.pyplot as plt
import seaborn as sns
from pandas_datareader import data

In [4]:
# series have explicit index and also implicit index (arrays just have inplicit index)
ser = pd.Series(np.random.randint(10, size=4))
ser

0    7
1    1
2    6
3    8
dtype: int64

In [5]:
#we can change the explicit index
ser.index = ["a", "A", "i", "ii"]
ser

a     7
A     1
i     6
ii    8
dtype: int64

In [6]:
ser.index

Index(['a', 'A', 'i', 'ii'], dtype='object')

In [7]:
ser.values

array([7, 1, 6, 8])

In [8]:
ser[0]

7

In [14]:
#create a series using dict
dict1 = {"a":1, "e" : 80, "c": 50, "f": 80}
ser = pd.Series(dict1, name= "a series")
ser

a     1
e    80
c    50
f    80
Name: a series, dtype: int64

In [15]:
ser.sort_index(ascending = False)

f    80
e    80
c    50
a     1
Name: a series, dtype: int64

In [16]:
ser.sort_values(ascending = False)

f    80
e    80
c    50
a     1
Name: a series, dtype: int64

In [22]:
## dataframe 
df = pd.DataFrame(np.random.rand(20).reshape(4,5) , columns = ["A", "B","C", "D","E"])
df.name = "A dataframe"
df
#(sample size is 4, number of observations is also 4)

          A         B         C         D         E
0  0.648037  0.699879  0.778116  0.644867  0.606898
1  0.639792  0.264405  0.556576  0.169780  0.308509
2  0.971853  0.497134  0.194726  0.238297  0.535317
3  0.329869  0.072895  0.558250  0.288920  0.012263

In [23]:
#columns are also called  features or attributes or variables 
#row are observation, sample, 

print(df.index)
print(df.columns)

RangeIndex(start=0, stop=4, step=1)
Index(['A', 'B', 'C', 'D', 'E'], dtype='object')

In [24]:
print(len(df)) # sample size so 4
print(df.shape)

4
(4, 5)

In [27]:
df["ind"] = ["i", "ii", "x", "iii"]
df
#can be mixture of many things

          A         B         C         D         E  ind
0  0.648037  0.699879  0.778116  0.644867  0.606898    i
1  0.639792  0.264405  0.556576  0.169780  0.308509   ii
2  0.971853  0.497134  0.194726  0.238297  0.535317    x
3  0.329869  0.072895  0.558250  0.288920  0.012263  iii

In [29]:
df.set_index("ind")
#after it becomes index its no longer a column
df #doesn't replace original data frame

          A         B         C         D         E  ind
0  0.648037  0.699879  0.778116  0.644867  0.606898    i
1  0.639792  0.264405  0.556576  0.169780  0.308509   ii
2  0.971853  0.497134  0.194726  0.238297  0.535317    x
3  0.329869  0.072895  0.558250  0.288920  0.012263  iii

In [32]:
#df.set_index("ind", inplace=True) #will replace original dataframe if ind column was there
#df

In [33]:
df["A"]

ind
i      0.648037
ii     0.639792
x      0.971853
iii    0.329869
Name: A, dtype: float64

In [38]:
#1 bc
dict1 = {"a":.25, "b" : .50, "c": .75, "d": 1.0}
ser = pd.Series(dict1)
ser

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [43]:
ser.index = ["i", "ii", "iii", "iv"]
ser
ser.sort_values(ascending = False)

iv     1.00
iii    0.75
ii     0.50
i      0.25
dtype: float64

In [46]:
dict1 = {"a":.25, "b" : .50, "c": .75, "d": 1.0}
ser = pd.Series(dict1)
ser

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [48]:
ser.loc["a"] #explicit index lookup (location)

0.25

In [50]:
ser.iloc[0] #implicit index

0.25

In [55]:
ser.loc["b":"c"] #will be included
ser.iloc[1:3] # last # will not be included

b    0.50
c    0.75
dtype: float64

In [57]:
ser.iloc[1:4]

b    0.50
c    0.75
d    1.00
dtype: float64

In [59]:
ser.loc[["b", "d"]]

b    0.5
d    1.0
dtype: float64

In [60]:
df

            A         B         C         D         E
ind
i    0.648037  0.699879  0.778116  0.644867  0.606898
ii   0.639792  0.264405  0.556576  0.169780  0.308509
x    0.971853  0.497134  0.194726  0.238297  0.535317
iii  0.329869  0.072895  0.558250  0.288920  0.012263

In [61]:
df["A"]

ind
i      0.648037
ii     0.639792
x      0.971853
iii    0.329869
Name: A, dtype: float64

In [62]:
df.loc["i"]

A    0.648037
B    0.699879
C    0.778116
D    0.644867
E    0.606898
Name: i, dtype: float64

In [64]:
df.iloc[-1]

A    0.329869
B    0.072895
C    0.558250
D    0.288920
E    0.012263
Name: iii, dtype: float64

In [66]:
#use loc or iloc for rows use df["column_name"] for columns
#slicing for columns use loc
df.loc[:] #gives all the rows
df.loc[:, "B":"D"] #slicing columns

            B         C         D
ind
i    0.699879  0.778116  0.644867
ii   0.264405  0.556576  0.169780
x    0.497134  0.194726  0.238297
iii  0.072895  0.558250  0.288920

In [83]:
#2
dict1 = {"California": 38332521, "Texas":26448193, "New York":19651127, "Florida":19552860, "Illinois":12882135}
dict2 = {"California": 423967, "Texas":695662, "New York":141297, "Florida":170312, "Illinois":149995}
df = pd.DataFrame({"State Population":dict1, "State Area": dict2})
df

            State Population  State Area
California          38332521      423967
Florida             19552860      170312
Illinois            12882135      149995
New York            19651127      141297
Texas               26448193      695662

In [78]:
df[df["State Population"] <20000000]

          State Population  State Area
Florida           19552860      170312
Illinois          12882135      149995
New York          19651127      141297

In [80]:
df["State Area"] [df["State Population"] <20000000]

Florida     170312
Illinois    149995
New York    141297
Name: State Area, dtype: int64

In [84]:
df["State Density"] = df["State Population"]/df["State Area"]
df

            State Population  State Area  State Density
California          38332521      423967      90.413926
Florida             19552860      170312     114.806121
Illinois            12882135      149995      85.883763
New York            19651127      141297     139.076746
Texas               26448193      695662      38.018740

In [86]:
#d
df.loc["California"]["State Area"]

423967.0

In [88]:
df = df[["State Area", "State Population", "State Density"]]
df

            State Area  State Population  State Density
California      423967          38332521      90.413926
Florida         170312          19552860     114.806121
Illinois        149995          12882135      85.883763
New York        141297          19651127     139.076746
Texas           695662          26448193      38.018740

In [89]:
df.iloc[-2:]

          State Area  State Population  State Density
New York      141297          19651127     139.076746
Texas         695662          26448193      38.018740

In [95]:
data = pd.read_csv("/Users/kevin/Downloads/AD 450/president_heights.csv")
data.columns #list of column names
data.head()
data.tail()

    order               name  height(cm)
37     40      Ronald Reagan         185
38     41  George H. W. Bush         188
39     42       Bill Clinton         188
40     43     George W. Bush         182
41     44       Barack Obama         185

In [104]:
# find the names of presidents with height above 190 cm

data["name"][data["height(cm)"] > 190]

15      Abraham Lincoln
33    Lyndon B. Johnson
Name: name, dtype: object

### Handle Missing Data

In [101]:
ser1 = pd.Series([1, np.nan, "Hello", None]) #missing data np.nan
ser1

0        1
1      NaN
2    Hello
3     None
dtype: object

In [103]:
ser1.isnull() #series

0    False
1     True
2    False
3     True
dtype: bool

In [106]:
ser1.isnull().any()

True

In [109]:
pf = pd.DataFrame([[1, np.nan, 2], #list of lists
                 [2,3,5],
                 [np.nan, 4, 6]])

pf

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [111]:
#drop it
pf.dropna() #keep row with no missing values

     0    1  2
1  2.0  3.0  5

In [112]:
#drop  column with missing value
pf.dropna(axis = 1)

   2
0  2
1  5
2  6

In [113]:
pf.dropna(axis = "columns") #more clear

   2
0  2
1  5
2  6

In [116]:
pf[3]=None
pf

     0    1  2     3
0  1.0  NaN  2  None
1  2.0  3.0  5  None
2  NaN  4.0  6  None

In [118]:
#drop just the columns with values all missing
pf.dropna(axis = "columns", how="all") #not going to replace dataframe

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [119]:
pf.fillna(0) #fill missing value with 0

     0    1  2  3
0  1.0  0.0  2  0
1  2.0  3.0  5  0
2  0.0  4.0  6  0

In [121]:
pf.fillna(pf.mean()) #mean of the particular column

     0    1  2   3
0  1.0  3.5  2 NaN
1  2.0  3.0  5 NaN
2  1.5  4.0  6 NaN

In [128]:
#3
df = pd.DataFrame([[1 , np.nan, 2, np.nan],
                  [2, 3, 5, 3.5],
                  [np.nan, 4, 6, np.nan]
                  ])
df

     0    1  2    3
0  1.0  NaN  2  NaN
1  2.0  3.0  5  3.5
2  NaN  4.0  6  NaN

In [129]:
df.columns = ["i", "ii", "iii", "iv"]
df.index = ["a", "b", "c"]

In [130]:
df.dropna()

     i   ii  iii   iv
b  2.0  3.0    5  3.5

In [133]:
df.dropna(axis = "columns")

   iii
a    2
b    5
c    6

In [134]:
df.dropna(axis = "columns" , how = "all")

     i   ii  iii   iv
a  1.0  NaN    2  NaN
b  2.0  3.0    5  3.5
c  NaN  4.0    6  NaN

In [136]:
df.fillna(0)

     i   ii  iii   iv
a  1.0  0.0    2  0.0
b  2.0  3.0    5  3.5
c  0.0  4.0    6  0.0

In [137]:
df.fillna(df.mean()) #fill missing value with the average of each column

     i   ii  iii   iv
a  1.0  3.5    2  3.5
b  2.0  3.0    5  3.5
c  1.5  4.0    6  3.5

In [140]:
df.dropna(axis = "columns" , thresh = 2) #drop columns with two or more missing values

     i   ii  iii
a  1.0  NaN    2
b  2.0  3.0    5
c  NaN  4.0    6

In [141]:
#check dataframe to see how missing values is represented. 
# -999 negative numbers for age, missing value, incorrect value.

### HW 
- fill missing value with the average of each row!

In [145]:
 #fill missing value with the average of each row ????

     i   ii  iii   iv
a  1.0  3.5    2  3.5
b  2.0  3.0    5  3.5
c  1.5  4.0    6  3.5

In [150]:
data = np.random.randint(1, 100, size= 100).reshape(25,4)
pf = pd.DataFrame(data)
pf.columns= ["W", "X", "Y", "Z"]
pf
#df2 = df anything changed in df2 changes

     W   X   Y   Z
0    3   6  73  34
1   31  69  24  69
2   37  18  88  13
3   15  12  39  54
4   27  83  21  30
5   48  50   4  19
6   88  88  99  99
7   83  64  36  44
8   55  98  18  94
9   46  37  43  47
10  39  53  91  25
11  11  63  56  77
12  51  24  68  39
13   3   8  52  88
14  58  76   4  88
15  33  78   8  34
16  59  38  85  67
17  96  28  90  64
18  76  53  57  78
19  24  60  84  75
20   3  63  86  39
21   7  97  14  20
22  41   2  85  97
23  13  75  23  55
24  43  17  11  88

In [152]:
pf[:5]

    W   X   Y   Z
0   3   6  73  34
1  31  69  24  69
2  37  18  88  13
3  15  12  39  54
4  27  83  21  30

In [153]:
pf[-5:]

     W   X   Y   Z
20   3  63  86  39
21   7  97  14  20
22  41   2  85  97
23  13  75  23  55
24  43  17  11  88

In [160]:
pf.loc[:,"X":"Z"]

     X   Y   Z
0    6  73  34
1   69  24  69
2   18  88  13
3   12  39  54
4   83  21  30
5   50   4  19
6   88  99  99
7   64  36  44
8   98  18  94
9   37  43  47
10  53  91  25
11  63  56  77
12  24  68  39
13   8  52  88
14  76   4  88
15  78   8  34
16  38  85  67
17  28  90  64
18  53  57  78
19  60  84  75
20  63  86  39
21  97  14  20
22   2  85  97
23  75  23  55
24  17  11  88

In [176]:
pf["W"].value_counts() #how many of each numbers appear in the dataframe

3     3
31    1
13    1
33    1
7     1
37    1
39    1
43    1
41    1
11    1
76    1
46    1
24    1
15    1
48    1
51    1
83    1
55    1
88    1
59    1
58    1
27    1
96    1
Name: W, dtype: int64

In [165]:
pf["Y"][pf["Y"]>50]

0     73
2     88
6     99
10    91
11    56
12    68
13    52
16    85
17    90
18    57
19    84
20    86
22    85
Name: Y, dtype: int64

In [185]:
#e
pf2 = pf.copy()
pf2.loc[pf2["Z"]<30, "Y"]= 30
pf2

     W   X   Y   Z     A
0    3   6  73  34   438
1   31  69  24  69  1656
2   37  18  30  13  1584
3   15  12  39  54   468
4   27  83  21  30  1743
5   48  50  30  19   200
6   88  88  99  99  8712
7   83  64  36  44  2304
8   55  98  18  94  1764
9   46  37  43  47  1591
10  39  53  30  25  4823
11  11  63  56  77  3528
12  51  24  68  39  1632
13   3   8  52  88   416
14  58  76   4  88   304
15  33  78   8  34   624
16  59  38  85  67  3230
17  96  28  90  64  2520
18  76  53  57  78  3021
19  24  60  84  75  5040
20   3  63  86  39  5418
21   7  97  30  20  1358
22  41   2  85  97   170
23  13  75  23  55  1725
24  43  17  11  88   187

In [178]:
pf["A"] = pf["X"] * pf["Y"]
pf

     W   X   Y   Z     A
0    3   6  73  34   438
1   31  69  24  69  1656
2   37  18  88  13  1584
3   15  12  39  54   468
4   27  83  21  30  1743
5   48  50   4  19   200
6   88  88  99  99  8712
7   83  64  36  44  2304
8   55  98  18  94  1764
9   46  37  43  47  1591
10  39  53  91  25  4823
11  11  63  56  77  3528
12  51  24  68  39  1632
13   3   8  52  88   416
14  58  76   4  88   304
15  33  78   8  34   624
16  59  38  85  67  3230
17  96  28  90  64  2520
18  76  53  57  78  3021
19  24  60  84  75  5040
20   3  63  86  39  5418
21   7  97  14  20  1358
22  41   2  85  97   170
23  13  75  23  55  1725
24  43  17  11  88   187

In [186]:
#g
pf.drop(pf[pf["Z"] <20].index)

     W   X   Y   Z     A
0    3   6  73  34   438
1   31  69  24  69  1656
3   15  12  39  54   468
4   27  83  21  30  1743
6   88  88  99  99  8712
7   83  64  36  44  2304
8   55  98  18  94  1764
9   46  37  43  47  1591
10  39  53  30  25  4823
11  11  63  56  77  3528
12  51  24  68  39  1632
13   3   8  52  88   416
14  58  76   4  88   304
15  33  78   8  34   624
16  59  38  85  67  3230
17  96  28  90  64  2520
18  76  53  57  78  3021
19  24  60  84  75  5040
20   3  63  86  39  5418
21   7  97  30  20  1358
22  41   2  85  97   170
23  13  75  23  55  1725
24  43  17  11  88   187